*** src/lib.rs:339:5: replace emit_summary_schema -> String with String::new()

*** mutation diff:
--- src/lib.rs
+++ replace emit_summary_schema -> String with String::new()
@@ -331,18 +331,17 @@
 /// Emit the JSON Schema for [`DatasetSummary`] as a pretty-printed string.
 ///
 /// # Panics
 ///
 /// Panics only if `serde_json` fails to serialize the schema, which cannot
 /// happen in practice for a schema derived from a concrete struct.
 #[must_use]
 pub fn emit_summary_schema() -> String {
-    let schema = schemars::schema_for!(DatasetSummary);
-    serde_json::to_string_pretty(&schema).expect("schemars schema is always serializable")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Emit the JSON Schema for [`OpResult`] as a pretty-printed string.
 ///
 /// # Panics
 ///
 /// Panics only if `serde_json` fails to serialize the schema.
 #[must_use]

---- unit_tests::emit_summary_schema_is_valid_json stdout ----

thread 'unit_tests::emit_summary_schema_is_valid_json' (3312722) panicked at src/lib.rs:420:49:
valid JSON: Error("EOF while parsing a value", line: 1, column: 0)

failures:
    unit_tests::emit_summary_schema_is_valid_json

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
