*** src/lib.rs:350:5: replace emit_op_result_schema -> String with "xyzzy".into()

*** mutation diff:
--- src/lib.rs
+++ replace emit_op_result_schema -> String with "xyzzy".into()
@@ -342,18 +342,17 @@
 
 /// Emit the JSON Schema for [`OpResult`] as a pretty-printed string.
 ///
 /// # Panics
 ///
 /// Panics only if `serde_json` fails to serialize the schema.
 #[must_use]
 pub fn emit_op_result_schema() -> String {
-    let schema = schemars::schema_for!(OpResult);
-    serde_json::to_string_pretty(&schema).expect("schemars schema is always serializable")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 // ── Unit tests ─────────────────────────────────────────────────────────────
 
 #[cfg(test)]
 mod unit_tests {
     use super::*;

---- unit_tests::emit_op_result_schema_is_valid_json stdout ----

thread 'unit_tests::emit_op_result_schema_is_valid_json' (3315848) panicked at src/lib.rs:427:49:
valid JSON: Error("expected value", line: 1, column: 1)

failures:
    unit_tests::emit_op_result_schema_is_valid_json

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
