*** src/lib.rs:109:28: replace == with != in capabilities

*** mutation diff:
--- src/lib.rs
+++ replace == with != in capabilities
@@ -101,17 +101,17 @@
 /// Rules:
 /// * `Pivot` requires ≥2 dimension columns.
 /// * All other capabilities are always advertised.
 #[must_use]
 pub fn capabilities(dataset: &Dataset) -> Vec<Capability> {
     let n_dims = dataset
         .columns
         .iter()
-        .filter(|c| c.role == ColumnRole::Dimension)
+        .filter(|c| c.role != /* ~ changed by cargo-mutants ~ */ ColumnRole::Dimension)
         .count();
 
     let mut caps = Vec::with_capacity(9);
     caps.push(Capability::Aggregate);
     caps.push(Capability::Filter);
     caps.push(Capability::Sort);
     caps.push(Capability::TopN);
     if n_dims >= 2 {

---- tests::ac4_capabilities_pivot_rule stdout ----

thread 'tests::ac4_capabilities_pivot_rule' panicked at src/lib.rs:725:9:
Pivot should be present with 2 dimensions

failures:
    tests::ac4_capabilities_pivot_rule

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
