*** src/lib.rs:176:9: delete match arm ColumnData::Decimal(v) | ColumnData::Str(v) | ColumnData::Date(v) | ColumnData::Time(v) in extract_value

*** mutation diff:
--- src/lib.rs
+++ delete match arm ColumnData::Decimal(v) | ColumnData::Str(v) | ColumnData::Date(v) | ColumnData::Time(v) in extract_value
@@ -168,21 +168,17 @@
             .get(row_idx)
             .and_then(|o| *o)
             .map_or(Value::Null, Value::from),
         ColumnData::Float(v) => v
             .get(row_idx)
             .and_then(|o| *o)
             .and_then(serde_json::Number::from_f64)
             .map_or(Value::Null, Value::Number),
-        ColumnData::Decimal(v) | ColumnData::Str(v) | ColumnData::Date(v)
-        | ColumnData::Time(v) => v
-            .get(row_idx)
-            .and_then(|o| o.as_deref())
-            .map_or(Value::Null, |s| Value::String(s.to_string())),
+         /* ~ changed by cargo-mutants ~ */
         ColumnData::Bool(v) => v
             .get(row_idx)
             .and_then(|o| *o)
             .map_or(Value::Null, Value::Bool),
         _ => Value::Null,
     }
 }

---- tests::ac6_max_bytes_truncates_sample_not_stats stdout ----

thread 'tests::ac6_max_bytes_truncates_sample_not_stats' panicked at src/lib.rs:509:5:
even the zero-sample summary exceeds max_bytes=1308 — increase max_bytes

failures:
    tests::ac6_max_bytes_truncates_sample_not_stats

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
