*** src/lib.rs:191:5: replace compute_stats -> HashMap<String, ColStats> with HashMap::new()

*** mutation diff:
--- src/lib.rs
+++ replace compute_stats -> HashMap<String, ColStats> with HashMap::new()
@@ -183,22 +183,17 @@
             .and_then(|o| *o)
             .map_or(Value::Null, Value::Bool),
         _ => Value::Null,
     }
 }
 
 /// Compute per-column statistics keyed by `unique_name`.
 fn compute_stats(dataset: &Dataset, topk: usize) -> HashMap<String, ColStats> {
-    let mut stats = HashMap::new();
-    for (col, data) in dataset.columns.iter().zip(dataset.data.iter()) {
-        let s = compute_col_stats(data, col.dtype, topk);
-        stats.insert(col.unique_name.clone(), s);
-    }
-    stats
+    HashMap::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn compute_col_stats(data: &ColumnData, dtype: DType, topk: usize) -> ColStats {
     match dtype {
         DType::Int => stats_int(data),
         DType::Float | DType::Decimal => stats_float(data),
         DType::Str => stats_str(data, topk),
         DType::Bool => stats_bool(data),

---- tests::ac2_numeric_stats_golden stdout ----

thread 'tests::ac2_numeric_stats_golden' panicked at src/lib.rs:610:51:
stats present

---- tests::ac3_categorical_topk_and_date_span stdout ----

thread 'tests::ac3_categorical_topk_and_date_span' panicked at src/lib.rs:661:61:
cat stats

---- tests::ac5_notes_nulls_and_dominant_group stdout ----

thread 'tests::ac5_notes_nulls_and_dominant_group' panicked at src/lib.rs:772:9:
expected a dominant-group note, got: []

failures:
    tests::ac2_numeric_stats_golden
    tests::ac3_categorical_topk_and_date_span
    tests::ac5_notes_nulls_and_dominant_group
    tests::ac6_max_bytes_truncates_sample_not_stats

test result: FAILED. 3 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
