*** src/lib.rs:212:9: delete match arm ColumnData::Int(v) in stats_int

*** mutation diff:
--- src/lib.rs
+++ delete match arm ColumnData::Int(v) in stats_int
@@ -204,22 +204,17 @@
         DType::Bool => stats_bool(data),
         DType::Date | DType::Time => stats_date(data),
     }
 }
 
 #[allow(clippy::cast_precision_loss)]
 fn stats_int(data: &ColumnData) -> ColStats {
     let (vals, null_count, total) = match data {
-        ColumnData::Int(v) => {
-            let non_null: Vec<i64> = v.iter().filter_map(|o| *o).collect();
-            let nulls = v.iter().filter(|o| o.is_none()).count() as u64;
-            let tot = v.len() as u64;
-            (non_null, nulls, tot)
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => (vec![], 0, 0),
     };
     let distinct = count_distinct_int(&vals);
     if vals.is_empty() {
         return ColStats {
             min: None,
             max: None,
             sum: None,

---- tests::ac2_numeric_stats_golden stdout ----

thread 'tests::ac2_numeric_stats_golden' panicked at src/lib.rs:611:9:
assertion `left == right` failed: min
  left: None
 right: Some(1.0)

failures:
    tests::ac2_numeric_stats_golden

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
