*** src/lib.rs:267:32: replace - with / in stats_float

*** mutation diff:
--- src/lib.rs
+++ replace - with / in stats_float
@@ -259,17 +259,17 @@
                 .filter_map(|s| s.parse::<f64>().ok())
                 .collect();
             let nulls = v.iter().filter(|o| o.is_none()).count() as u64;
             let tot = v.len() as u64;
             (non_null, nulls, tot)
         }
         _ => (vec![], 0, 0),
     };
-    let non_null_count = total - null_count;
+    let non_null_count = total / /* ~ changed by cargo-mutants ~ */ null_count;
     if vals.is_empty() {
         return ColStats {
             min: None,
             max: None,
             sum: None,
             mean: None,
             distinct: Some(null_count.min(1)),
             top_k: None,

---- tests::ac6_max_bytes_truncates_sample_not_stats stdout ----

thread 'tests::ac6_max_bytes_truncates_sample_not_stats' panicked at src/lib.rs:267:26:
attempt to divide by zero

---- tests::ac1_large_dataset_sample_and_size_bounds stdout ----

thread 'tests::ac1_large_dataset_sample_and_size_bounds' panicked at src/lib.rs:267:26:
attempt to divide by zero

failures:
    tests::ac1_large_dataset_sample_and_size_bounds
    tests::ac6_max_bytes_truncates_sample_not_stats

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
