*** src/lib.rs:281:20: replace / with * in stats_float

*** mutation diff:
--- src/lib.rs
+++ replace / with * in stats_float
@@ -273,17 +273,17 @@
             mean: None,
             distinct: Some(null_count.min(1)),
             top_k: None,
         };
     }
     let min = vals.iter().copied().fold(f64::INFINITY, f64::min);
     let max = vals.iter().copied().fold(f64::NEG_INFINITY, f64::max);
     let sum: f64 = vals.iter().sum();
-    let mean = sum / non_null_count as f64;
+    let mean = sum * /* ~ changed by cargo-mutants ~ */ non_null_count as f64;
     // Approximate distinct count via sort-dedup on bits.
     let mut sorted = vals.clone();
     sorted.sort_by(f64::total_cmp);
     sorted.dedup_by(|a, b| a.to_bits() == b.to_bits());
     let distinct = sorted.len() as u64 + null_count.min(1);
     ColStats {
         min: Some(min),
         max: Some(max),

*** result: Success
