*** src/lib.rs:309:37: replace += with -= in stats_str

*** mutation diff:
--- src/lib.rs
+++ replace += with -= in stats_str
@@ -301,17 +301,17 @@
             let non_null: Vec<&str> = v.iter().filter_map(|o| o.as_deref()).collect();
             let nulls = v.iter().filter(|o| o.is_none()).count() as u64;
             (non_null, nulls)
         }
         _ => (vec![], 0),
     };
     let mut freq: HashMap<&str, u64> = HashMap::new();
     for s in &values {
-        *freq.entry(s).or_insert(0) += 1;
+        *freq.entry(s).or_insert(0) -= /* ~ changed by cargo-mutants ~ */ 1;
     }
     let distinct = freq.len() as u64 + null_count.min(1);
     let mut freq_vec: Vec<(&str, u64)> = freq.into_iter().collect();
     freq_vec.sort_by(|a, b| b.1.cmp(&a.1).then(a.0.cmp(b.0)));
     freq_vec.truncate(topk);
     let entries: Vec<Value> = freq_vec
         .into_iter()
         .map(|(s, c)| serde_json::json!({"value": s, "count": c}))

---- tests::ac3_categorical_topk_and_date_span stdout ----

thread 'tests::ac3_categorical_topk_and_date_span' panicked at src/lib.rs:309:9:
attempt to subtract with overflow

---- tests::ac5_notes_nulls_and_dominant_group stdout ----

thread 'tests::ac5_notes_nulls_and_dominant_group' panicked at src/lib.rs:309:9:
attempt to subtract with overflow

---- tests::ac7_round_trip_serialization stdout ----

thread 'tests::ac7_round_trip_serialization' panicked at src/lib.rs:309:9:
attempt to subtract with overflow

failures:
    tests::ac3_categorical_topk_and_date_span
    tests::ac5_notes_nulls_and_dominant_group
    tests::ac6_max_bytes_truncates_sample_not_stats
    tests::ac7_round_trip_serialization

test result: FAILED. 3 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
