*** src/lib.rs:311:38: replace + with * in stats_str

*** mutation diff:
--- src/lib.rs
+++ replace + with * in stats_str
@@ -303,17 +303,17 @@
             (non_null, nulls)
         }
         _ => (vec![], 0),
     };
     let mut freq: HashMap<&str, u64> = HashMap::new();
     for s in &values {
         *freq.entry(s).or_insert(0) += 1;
     }
-    let distinct = freq.len() as u64 + null_count.min(1);
+    let distinct = freq.len() as u64 * /* ~ changed by cargo-mutants ~ */ null_count.min(1);
     let mut freq_vec: Vec<(&str, u64)> = freq.into_iter().collect();
     freq_vec.sort_by(|a, b| b.1.cmp(&a.1).then(a.0.cmp(b.0)));
     freq_vec.truncate(topk);
     let entries: Vec<Value> = freq_vec
         .into_iter()
         .map(|(s, c)| serde_json::json!({"value": s, "count": c}))
         .collect();
     ColStats {

*** result: Success
