*** src/lib.rs:339:36: replace > with == in stats_bool

*** mutation diff:
--- src/lib.rs
+++ replace > with == in stats_bool
@@ -331,17 +331,17 @@
         ColumnData::Bool(v) => {
             let t = v.iter().filter(|o| matches!(o, Some(true))).count() as u64;
             let f = v.iter().filter(|o| matches!(o, Some(false))).count() as u64;
             let n = v.iter().filter(|o| o.is_none()).count() as u64;
             (t, f, n)
         }
         _ => (0, 0, 0),
     };
-    let distinct = u64::from(trues > 0) + u64::from(falses > 0) + u64::from(nulls > 0);
+    let distinct = u64::from(trues == /* ~ changed by cargo-mutants ~ */ 0) + u64::from(falses > 0) + u64::from(nulls > 0);
     let mut entries: Vec<Value> = Vec::new();
     if trues > 0 {
         entries.push(serde_json::json!({"value": true, "count": trues}));
     }
     if falses > 0 {
         entries.push(serde_json::json!({"value": false, "count": falses}));
     }
     ColStats {

*** result: Success
