*** src/lib.rs:341:14: replace > with >= in stats_bool

*** mutation diff:
--- src/lib.rs
+++ replace > with >= in stats_bool
@@ -333,17 +333,17 @@
             let f = v.iter().filter(|o| matches!(o, Some(false))).count() as u64;
             let n = v.iter().filter(|o| o.is_none()).count() as u64;
             (t, f, n)
         }
         _ => (0, 0, 0),
     };
     let distinct = u64::from(trues > 0) + u64::from(falses > 0) + u64::from(nulls > 0);
     let mut entries: Vec<Value> = Vec::new();
-    if trues > 0 {
+    if trues >= /* ~ changed by cargo-mutants ~ */ 0 {
         entries.push(serde_json::json!({"value": true, "count": trues}));
     }
     if falses > 0 {
         entries.push(serde_json::json!({"value": false, "count": falses}));
     }
     ColStats {
         min: None,
         max: None,

*** result: Success
