*** src/lib.rs:344:15: replace > with < in stats_bool

*** mutation diff:
--- src/lib.rs
+++ replace > with < in stats_bool
@@ -336,17 +336,17 @@
         }
         _ => (0, 0, 0),
     };
     let distinct = u64::from(trues > 0) + u64::from(falses > 0) + u64::from(nulls > 0);
     let mut entries: Vec<Value> = Vec::new();
     if trues > 0 {
         entries.push(serde_json::json!({"value": true, "count": trues}));
     }
-    if falses > 0 {
+    if falses < /* ~ changed by cargo-mutants ~ */ 0 {
         entries.push(serde_json::json!({"value": false, "count": falses}));
     }
     ColStats {
         min: None,
         max: None,
         sum: None,
         mean: None,
         distinct: Some(distinct),

*** result: Success
