*** src/lib.rs:405:19: replace == with != in generate_notes

*** mutation diff:
--- src/lib.rs
+++ replace == with != in generate_notes
@@ -397,17 +397,17 @@
     v.len() as u64
 }
 
 /// Generate deterministic notes about nulls, dominant groups, date spans, etc.
 #[allow(clippy::cast_precision_loss)]
 fn generate_notes(dataset: &Dataset, stats: &HashMap<String, ColStats>) -> Vec<String> {
     let mut notes = Vec::new();
     let total_rows = dataset.row_count();
-    if total_rows == 0 {
+    if total_rows != /* ~ changed by cargo-mutants ~ */ 0 {
         notes.push("Dataset is empty.".to_string());
         return notes;
     }
 
     for (col, data) in dataset.columns.iter().zip(dataset.data.iter()) {
         // Null note
         let null_count = count_nulls(data);
         if null_count > 0 {

---- tests::ac5_notes_nulls_and_dominant_group stdout ----

thread 'tests::ac5_notes_nulls_and_dominant_group' panicked at src/lib.rs:745:9:
expected a null note, got: ["Dataset is empty."]

failures:
    tests::ac5_notes_nulls_and_dominant_group

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
