*** src/lib.rs:413:23: replace > with < in generate_notes

*** mutation diff:
--- src/lib.rs
+++ replace > with < in generate_notes
@@ -405,17 +405,17 @@
     if total_rows == 0 {
         notes.push("Dataset is empty.".to_string());
         return notes;
     }
 
     for (col, data) in dataset.columns.iter().zip(dataset.data.iter()) {
         // Null note
         let null_count = count_nulls(data);
-        if null_count > 0 {
+        if null_count < /* ~ changed by cargo-mutants ~ */ 0 {
             notes.push(format!(
                 "{} of {} {} values are null",
                 null_count, total_rows, col.name
             ));
         }
 
         // Dominant group note for categoricals
         if col.dtype == DType::Str {

---- tests::ac5_notes_nulls_and_dominant_group stdout ----

thread 'tests::ac5_notes_nulls_and_dominant_group' panicked at src/lib.rs:745:9:
expected a null note, got: []

failures:
    tests::ac5_notes_nulls_and_dominant_group

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
