*** src/lib.rs:426:72: replace * with + in generate_notes

*** mutation diff:
--- src/lib.rs
+++ replace * with + in generate_notes
@@ -418,17 +418,17 @@
         }
 
         // Dominant group note for categoricals
         if col.dtype == DType::Str {
             if let Some(cs) = stats.get(&col.unique_name) {
                 if let Some(topk_vals) = &cs.top_k {
                     if let Some(first) = topk_vals.first() {
                         if let Some(count) = first.get("count").and_then(Value::as_u64) {
-                            let pct = count as f64 / total_rows as f64 * 100.0;
+                            let pct = count as f64 / total_rows as f64 + /* ~ changed by cargo-mutants ~ */ 100.0;
                             if pct >= 50.0 {
                                 let value = first
                                     .get("value")
                                     .and_then(Value::as_str)
                                     .unwrap_or("(unknown)");
                                 notes.push(format!(
                                     "one {} group ({value:?}) accounts for {pct:.0}% of total",
                                     col.name

*** result: Success
