*** src/lib.rs:426:72: replace * with / in generate_notes

*** mutation diff:
--- src/lib.rs
+++ replace * with / in generate_notes
@@ -418,17 +418,17 @@
         }
 
         // Dominant group note for categoricals
         if col.dtype == DType::Str {
             if let Some(cs) = stats.get(&col.unique_name) {
                 if let Some(topk_vals) = &cs.top_k {
                     if let Some(first) = topk_vals.first() {
                         if let Some(count) = first.get("count").and_then(Value::as_u64) {
-                            let pct = count as f64 / total_rows as f64 * 100.0;
+                            let pct = count as f64 / total_rows as f64 / /* ~ changed by cargo-mutants ~ */ 100.0;
                             if pct >= 50.0 {
                                 let value = first
                                     .get("value")
                                     .and_then(Value::as_str)
                                     .unwrap_or("(unknown)");
                                 notes.push(format!(
                                     "one {} group ({value:?}) accounts for {pct:.0}% of total",
                                     col.name

---- tests::ac5_notes_nulls_and_dominant_group stdout ----

thread 'tests::ac5_notes_nulls_and_dominant_group' panicked at src/lib.rs:777:9:
expected a dominant-group note, got: []

failures:
    tests::ac5_notes_nulls_and_dominant_group

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
