*** src/lib.rs:492:33: replace <= with > in enforce_max_bytes

*** mutation diff:
--- src/lib.rs
+++ replace <= with > in enforce_max_bytes
@@ -484,17 +484,17 @@
 /// `max_bytes`, this function panics (the caller's `max_bytes` is too small).
 fn enforce_max_bytes(
     mut summary: DatasetSummary,
     row_count: u64,
     cfg: &SummaryCfg,
     notes: &mut Vec<String>,
 ) -> DatasetSummary {
     // Fast path: already within budget.
-    if serialized_len(&summary) <= cfg.max_bytes {
+    if serialized_len(&summary) > /* ~ changed by cargo-mutants ~ */ cfg.max_bytes {
         return summary;
     }
 
     // Progressive truncation: remove tail rows one at a time.
     let original_sample_len = summary.sample.len();
     while !summary.sample.is_empty() && serialized_len(&summary) > cfg.max_bytes {
         summary.sample.pop();
     }

---- tests::ac6_max_bytes_truncates_sample_not_stats stdout ----

thread 'tests::ac6_max_bytes_truncates_sample_not_stats' panicked at src/lib.rs:830:9:
size=1829 must be ≤ max_bytes=1828

failures:
    tests::ac6_max_bytes_truncates_sample_not_stats

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
