*** src/lib.rs:117:15: replace >= with < in capabilities

*** mutation diff:
--- src/lib.rs
+++ replace >= with < in capabilities
@@ -109,17 +109,17 @@
         .filter(|c| c.role == ColumnRole::Dimension)
         .count();
 
     let mut caps = Vec::with_capacity(9);
     caps.push(Capability::Aggregate);
     caps.push(Capability::Filter);
     caps.push(Capability::Sort);
     caps.push(Capability::TopN);
-    if n_dims >= 2 {
+    if n_dims < /* ~ changed by cargo-mutants ~ */ 2 {
         caps.push(Capability::Pivot);
     }
     caps.push(Capability::Compare);
     caps.push(Capability::Drill);
     caps.push(Capability::Describe);
     caps.push(Capability::Export);
     caps
 }

---- tests::ac4_capabilities_pivot_rule stdout ----

thread 'tests::ac4_capabilities_pivot_rule' panicked at src/lib.rs:710:9:
Pivot should be absent with 1 dimension

failures:
    tests::ac4_capabilities_pivot_rule

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
