*** src/lib.rs:132:29: replace == with != in build_sample

*** mutation diff:
--- src/lib.rs
+++ replace == with != in build_sample
@@ -124,17 +124,17 @@
     caps
 }
 
 // ── Internal helpers ────────────────────────────────────────────────────────
 
 /// Build the head+tail sample, capped at `sample_cap` total rows.
 fn build_sample(dataset: &Dataset, sample_cap: usize) -> Vec<Row> {
     let n = dataset.row_count();
-    if n == 0 || sample_cap == 0 {
+    if n == 0 || sample_cap != /* ~ changed by cargo-mutants ~ */ 0 {
         return Vec::new();
     }
 
     let head_count = (sample_cap + 1) / 2; // ceiling half
     let tail_count = sample_cap / 2;
 
     // Which row indices to include (deduped, in order)
     let mut indices: Vec<usize> = Vec::with_capacity(sample_cap);

---- tests::ac6_max_bytes_truncates_sample_not_stats stdout ----

thread 'tests::ac6_max_bytes_truncates_sample_not_stats' panicked at src/lib.rs:513:5:
even the zero-sample summary exceeds max_bytes=950 — increase max_bytes

failures:
    tests::ac6_max_bytes_truncates_sample_not_stats

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
