*** src/lib.rs:137:33: replace / with % in build_sample

*** mutation diff:
--- src/lib.rs
+++ replace / with % in build_sample
@@ -129,17 +129,17 @@
 /// Build the head+tail sample, capped at `sample_cap` total rows.
 fn build_sample(dataset: &Dataset, sample_cap: usize) -> Vec<Row> {
     let n = dataset.row_count();
     if n == 0 || sample_cap == 0 {
         return Vec::new();
     }
 
     let head_count = (sample_cap + 1) / 2; // ceiling half
-    let tail_count = sample_cap / 2;
+    let tail_count = sample_cap % /* ~ changed by cargo-mutants ~ */ 2;
 
     // Which row indices to include (deduped, in order)
     let mut indices: Vec<usize> = Vec::with_capacity(sample_cap);
     for i in 0..head_count.min(n) {
         indices.push(i);
     }
     if tail_count > 0 {
         let tail_start = n.saturating_sub(tail_count).max(head_count.min(n));

*** result: Success
