*** src/lib.rs:156:5: replace row_to_map -> Row with Default::default()

*** mutation diff:
--- src/lib.rs
+++ replace row_to_map -> Row with Default::default()
@@ -148,22 +148,17 @@
         }
     }
 
     indices.iter().map(|&row_idx| row_to_map(dataset, row_idx)).collect()
 }
 
 /// Convert a single row index into a `Row` (`HashMap`<String, Value>).
 fn row_to_map(dataset: &Dataset, row_idx: usize) -> Row {
-    let mut map = Row::new();
-    for (col, data) in dataset.columns.iter().zip(dataset.data.iter()) {
-        let val = extract_value(data, row_idx);
-        map.insert(col.name.clone(), val);
-    }
-    map
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Extract the JSON `Value` at position `row_idx` from [`ColumnData`].
 fn extract_value(data: &ColumnData, row_idx: usize) -> Value {
     match data {
         ColumnData::Int(v) => v
             .get(row_idx)
             .and_then(|o| *o)

---- tests::ac6_max_bytes_truncates_sample_not_stats stdout ----

thread 'tests::ac6_max_bytes_truncates_sample_not_stats' panicked at src/lib.rs:508:5:
even the zero-sample summary exceeds max_bytes=973 — increase max_bytes

failures:
    tests::ac6_max_bytes_truncates_sample_not_stats

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
