*** src/lib.rs:234:32: replace - with / in stats_int

*** mutation diff:
--- src/lib.rs
+++ replace - with / in stats_int
@@ -226,17 +226,17 @@
             mean: None,
             distinct: Some(distinct + null_count.min(1)),
             top_k: None,
         };
     }
     let min = vals.iter().copied().min().unwrap() as f64;
     let max = vals.iter().copied().max().unwrap() as f64;
     let sum: f64 = vals.iter().map(|&v| v as f64).sum();
-    let non_null_count = total - null_count;
+    let non_null_count = total / /* ~ changed by cargo-mutants ~ */ null_count;
     let mean = sum / non_null_count as f64;
     ColStats {
         min: Some(min),
         max: Some(max),
         sum: Some(sum),
         mean: Some(mean),
         distinct: Some(distinct + null_count.min(1)),
         top_k: None,

---- tests::max_bytes_one_over_triggers_truncation stdout ----

thread 'tests::max_bytes_one_over_triggers_truncation' panicked at src/lib.rs:234:26:
attempt to divide by zero

---- tests::ac2_numeric_stats_golden stdout ----

thread 'tests::ac2_numeric_stats_golden' panicked at src/lib.rs:234:26:
attempt to divide by zero

---- tests::ac7_round_trip_serialization stdout ----

thread 'tests::ac7_round_trip_serialization' panicked at src/lib.rs:234:26:
attempt to divide by zero

failures:
    tests::ac2_numeric_stats_golden
    tests::ac5_notes_nulls_and_dominant_group
    tests::ac7_round_trip_serialization
    tests::max_bytes_exact_fit_no_truncation
    tests::max_bytes_one_over_triggers_truncation
    tests::notes_dominance_threshold_boundary

test result: FAILED. 11 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
