*** src/lib.rs:235:20: replace / with % in stats_int

*** mutation diff:
--- src/lib.rs
+++ replace / with % in stats_int
@@ -227,17 +227,17 @@
             distinct: Some(distinct + null_count.min(1)),
             top_k: None,
         };
     }
     let min = vals.iter().copied().min().unwrap() as f64;
     let max = vals.iter().copied().max().unwrap() as f64;
     let sum: f64 = vals.iter().map(|&v| v as f64).sum();
     let non_null_count = total - null_count;
-    let mean = sum / non_null_count as f64;
+    let mean = sum % /* ~ changed by cargo-mutants ~ */ non_null_count as f64;
     ColStats {
         min: Some(min),
         max: Some(max),
         sum: Some(sum),
         mean: Some(mean),
         distinct: Some(distinct + null_count.min(1)),
         top_k: None,
     }

---- tests::ac2_numeric_stats_golden stdout ----

thread 'tests::ac2_numeric_stats_golden' panicked at src/lib.rs:619:9:
assertion `left == right` failed: mean
  left: Some(0.0)
 right: Some(3.0)

failures:
    tests::ac2_numeric_stats_golden

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
