*** src/lib.rs:241:33: replace + with - in stats_int

*** mutation diff:
--- src/lib.rs
+++ replace + with - in stats_int
@@ -233,17 +233,17 @@
     let sum: f64 = vals.iter().map(|&v| v as f64).sum();
     let non_null_count = total - null_count;
     let mean = sum / non_null_count as f64;
     ColStats {
         min: Some(min),
         max: Some(max),
         sum: Some(sum),
         mean: Some(mean),
-        distinct: Some(distinct + null_count.min(1)),
+        distinct: Some(distinct - /* ~ changed by cargo-mutants ~ */ null_count.min(1)),
         top_k: None,
     }
 }
 
 #[allow(clippy::cast_precision_loss)]
 fn stats_float(data: &ColumnData) -> ColStats {
     let (vals, null_count, total) = match data {
         ColumnData::Float(v) => {

*** result: Success
