*** src/lib.rs:249:9: delete match arm ColumnData::Float(v) in stats_float

*** mutation diff:
--- src/lib.rs
+++ delete match arm ColumnData::Float(v) in stats_float
@@ -241,22 +241,17 @@
         distinct: Some(distinct + null_count.min(1)),
         top_k: None,
     }
 }
 
 #[allow(clippy::cast_precision_loss)]
 fn stats_float(data: &ColumnData) -> ColStats {
     let (vals, null_count, total) = match data {
-        ColumnData::Float(v) => {
-            let non_null: Vec<f64> = v.iter().filter_map(|o| *o).collect();
-            let nulls = v.iter().filter(|o| o.is_none()).count() as u64;
-            let tot = v.len() as u64;
-            (non_null, nulls, tot)
-        }
+         /* ~ changed by cargo-mutants ~ */
         ColumnData::Decimal(v) => {
             let non_null: Vec<f64> = v
                 .iter()
                 .filter_map(|o| o.as_deref())
                 .filter_map(|s| s.parse::<f64>().ok())
                 .collect();
             let nulls = v.iter().filter(|o| o.is_none()).count() as u64;
             let tot = v.len() as u64;

---- tests::stats_float_golden stdout ----

thread 'tests::stats_float_golden' panicked at src/lib.rs:1141:9:
assertion `left == right` failed: min=2.0
  left: None
 right: Some(2.0)

---- tests::ac6_max_bytes_truncates_sample_not_stats stdout ----

thread 'tests::ac6_max_bytes_truncates_sample_not_stats' panicked at src/lib.rs:839:9:
min stat present

failures:
    tests::ac6_max_bytes_truncates_sample_not_stats
    tests::stats_float_golden

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
