*** src/lib.rs:339:65: replace + with - in stats_bool

*** mutation diff:
--- src/lib.rs
+++ replace + with - in stats_bool
@@ -331,17 +331,17 @@
         ColumnData::Bool(v) => {
             let t = v.iter().filter(|o| matches!(o, Some(true))).count() as u64;
             let f = v.iter().filter(|o| matches!(o, Some(false))).count() as u64;
             let n = v.iter().filter(|o| o.is_none()).count() as u64;
             (t, f, n)
         }
         _ => (0, 0, 0),
     };
-    let distinct = u64::from(trues > 0) + u64::from(falses > 0) + u64::from(nulls > 0);
+    let distinct = u64::from(trues > 0) + u64::from(falses > 0) - /* ~ changed by cargo-mutants ~ */ u64::from(nulls > 0);
     let mut entries: Vec<Value> = Vec::new();
     if trues > 0 {
         entries.push(serde_json::json!({"value": true, "count": trues}));
     }
     if falses > 0 {
         entries.push(serde_json::json!({"value": false, "count": falses}));
     }
     ColStats {

---- tests::stats_bool_all_null stdout ----

thread 'tests::stats_bool_all_null' panicked at src/lib.rs:339:20:
attempt to subtract with overflow

---- tests::stats_bool_counts_and_top_k stdout ----

thread 'tests::stats_bool_counts_and_top_k' panicked at src/lib.rs:902:9:
assertion `left == right` failed: distinct should be 3 (true, false, null)
  left: Some(1)
 right: Some(3)

failures:
    tests::stats_bool_all_null
    tests::stats_bool_counts_and_top_k

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
