*** src/lib.rs:344:15: replace > with == in stats_bool

*** mutation diff:
--- src/lib.rs
+++ replace > with == in stats_bool
@@ -336,17 +336,17 @@
         }
         _ => (0, 0, 0),
     };
     let distinct = u64::from(trues > 0) + u64::from(falses > 0) + u64::from(nulls > 0);
     let mut entries: Vec<Value> = Vec::new();
     if trues > 0 {
         entries.push(serde_json::json!({"value": true, "count": trues}));
     }
-    if falses > 0 {
+    if falses == /* ~ changed by cargo-mutants ~ */ 0 {
         entries.push(serde_json::json!({"value": false, "count": falses}));
     }
     ColStats {
         min: None,
         max: None,
         sum: None,
         mean: None,
         distinct: Some(distinct),

---- tests::stats_bool_counts_and_top_k stdout ----

thread 'tests::stats_bool_counts_and_top_k' panicked at src/lib.rs:909:9:
false entry present in top_k

---- tests::stats_bool_all_null stdout ----

thread 'tests::stats_bool_all_null' panicked at src/lib.rs:932:9:
no top_k when only nulls

---- tests::stats_bool_all_false stdout ----

thread 'tests::stats_bool_all_false' panicked at src/lib.rs:944:38:
top_k present

failures:
    tests::stats_bool_all_false
    tests::stats_bool_all_null
    tests::stats_bool_counts_and_top_k

test result: FAILED. 14 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
