*** src/lib.rs:359:9: delete match arm ColumnData::Date(v) | ColumnData::Time(v) in stats_date

*** mutation diff:
--- src/lib.rs
+++ delete match arm ColumnData::Date(v) | ColumnData::Time(v) in stats_date
@@ -351,21 +351,17 @@
         mean: None,
         distinct: Some(distinct),
         top_k: if entries.is_empty() { None } else { Some(entries) },
     }
 }
 
 fn stats_date(data: &ColumnData) -> ColStats {
     let (values, null_count) = match data {
-        ColumnData::Date(v) | ColumnData::Time(v) => {
-            let non_null: Vec<&str> = v.iter().filter_map(|o| o.as_deref()).collect();
-            let nulls = v.iter().filter(|o| o.is_none()).count() as u64;
-            (non_null, nulls)
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => (vec![], 0),
     };
     let mut sorted: Vec<&str> = values.clone();
     sorted.sort_unstable();
     let min_s = sorted.first().map(|s| (*s).to_string());
     let max_s = sorted.last().map(|s| (*s).to_string());
     let distinct: u64 = {
         let mut u = sorted.clone();

---- tests::ac3_categorical_topk_and_date_span stdout ----

thread 'tests::ac3_categorical_topk_and_date_span' panicked at src/lib.rs:677:51:
date top_k

---- tests::notes_date_span_format stdout ----

thread 'tests::notes_date_span_format' panicked at src/lib.rs:1113:9:
date span note present: []

failures:
    tests::ac3_categorical_topk_and_date_span
    tests::notes_date_span_format

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
