*** src/lib.rs:377:9: delete match arm (Some(min), Some(max)) in stats_date

*** mutation diff:
--- src/lib.rs
+++ delete match arm (Some(min), Some(max)) in stats_date
@@ -369,20 +369,17 @@
     let max_s = sorted.last().map(|s| (*s).to_string());
     let distinct: u64 = {
         let mut u = sorted.clone();
         u.dedup();
         u.len() as u64 + null_count.min(1)
     };
     // Surface min/max via top_k so notes and tests can read them.
     let span_entry = match (&min_s, &max_s) {
-        (Some(min), Some(max)) => Some(vec![
-            serde_json::json!({"value": min, "label": "min"}),
-            serde_json::json!({"value": max, "label": "max"}),
-        ]),
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     };
     ColStats {
         min: None,
         max: None,
         sum: None,
         mean: None,
         distinct: Some(distinct),

---- tests::notes_date_span_format stdout ----

thread 'tests::notes_date_span_format' panicked at src/lib.rs:1114:9:
date span note present: []

---- tests::ac3_categorical_topk_and_date_span stdout ----

thread 'tests::ac3_categorical_topk_and_date_span' panicked at src/lib.rs:678:51:
date top_k

failures:
    tests::ac3_categorical_topk_and_date_span
    tests::notes_date_span_format

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
