*** src/lib.rs:394:5: replace count_distinct_int -> u64 with 0

*** mutation diff:
--- src/lib.rs
+++ replace count_distinct_int -> u64 with 0
@@ -386,20 +386,17 @@
         sum: None,
         mean: None,
         distinct: Some(distinct),
         top_k: span_entry,
     }
 }
 
 fn count_distinct_int(vals: &[i64]) -> u64 {
-    let mut v = vals.to_vec();
-    v.sort_unstable();
-    v.dedup();
-    v.len() as u64
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Generate deterministic notes about nulls, dominant groups, date spans, etc.
 #[allow(clippy::cast_precision_loss)]
 fn generate_notes(dataset: &Dataset, stats: &HashMap<String, ColStats>) -> Vec<String> {
     let mut notes = Vec::new();
     let total_rows = dataset.row_count();
     if total_rows == 0 {

---- tests::ac2_numeric_stats_golden stdout ----

thread 'tests::ac2_numeric_stats_golden' panicked at src/lib.rs:617:9:
assertion `left == right` failed: distinct
  left: Some(0)
 right: Some(5)

failures:
    tests::ac2_numeric_stats_golden

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
