*** src/lib.rs:394:5: replace count_distinct_int -> u64 with 1

*** mutation diff:
--- src/lib.rs
+++ replace count_distinct_int -> u64 with 1
@@ -386,20 +386,17 @@
         sum: None,
         mean: None,
         distinct: Some(distinct),
         top_k: span_entry,
     }
 }
 
 fn count_distinct_int(vals: &[i64]) -> u64 {
-    let mut v = vals.to_vec();
-    v.sort_unstable();
-    v.dedup();
-    v.len() as u64
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Generate deterministic notes about nulls, dominant groups, date spans, etc.
 #[allow(clippy::cast_precision_loss)]
 fn generate_notes(dataset: &Dataset, stats: &HashMap<String, ColStats>) -> Vec<String> {
     let mut notes = Vec::new();
     let total_rows = dataset.row_count();
     if total_rows == 0 {

---- tests::ac2_numeric_stats_golden stdout ----

thread 'tests::ac2_numeric_stats_golden' panicked at src/lib.rs:617:9:
assertion `left == right` failed: distinct
  left: Some(1)
 right: Some(5)

---- tests::stats_int_all_null stdout ----

thread 'tests::stats_int_all_null' panicked at src/lib.rs:1132:9:
assertion `left == right` failed: 1 distinct (null)
  left: Some(2)
 right: Some(1)

failures:
    tests::ac2_numeric_stats_golden
    tests::stats_int_all_null

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
