*** src/lib.rs:403:5: replace generate_notes -> Vec<String> with vec![String::new()]

*** mutation diff:
--- src/lib.rs
+++ replace generate_notes -> Vec<String> with vec![String::new()]
@@ -395,79 +395,17 @@
     v.sort_unstable();
     v.dedup();
     v.len() as u64
 }
 
 /// Generate deterministic notes about nulls, dominant groups, date spans, etc.
 #[allow(clippy::cast_precision_loss)]
 fn generate_notes(dataset: &Dataset, stats: &HashMap<String, ColStats>) -> Vec<String> {
-    let mut notes = Vec::new();
-    let total_rows = dataset.row_count();
-    if total_rows == 0 {
-        notes.push("Dataset is empty.".to_string());
-        return notes;
-    }
-
-    for (col, data) in dataset.columns.iter().zip(dataset.data.iter()) {
-        // Null note
-        let null_count = count_nulls(data);
-        if null_count > 0 {
-            notes.push(format!(
-                "{} of {} {} values are null",
-                null_count, total_rows, col.name
-            ));
-        }
-
-        // Dominant group note for categoricals
-        if col.dtype == DType::Str {
-            if let Some(cs) = stats.get(&col.unique_name) {
-                if let Some(topk_vals) = &cs.top_k {
-                    if let Some(first) = topk_vals.first() {
-                        if let Some(count) = first.get("count").and_then(Value::as_u64) {
-                            let pct = count as f64 / total_rows as f64 * 100.0;
-                            if pct >= 50.0 {
-                                let value = first
-                                    .get("value")
-                                    .and_then(Value::as_str)
-                                    .unwrap_or("(unknown)");
-                                notes.push(format!(
-                                    "one {} group ({value:?}) accounts for {pct:.0}% of total",
-                                    col.name
-                                ));
-                            }
-                        }
-                    }
-                }
-            }
-        }
-
-        // Date span note
-        if col.dtype == DType::Date || col.dtype == DType::Time {
-            if let Some(cs) = stats.get(&col.unique_name) {
-                if let Some(topk_vals) = &cs.top_k {
-                    let min_val = topk_vals
-                        .iter()
-                        .find(|v| v.get("label").and_then(Value::as_str) == Some("min"))
-                        .and_then(|v| v.get("value"))
-                        .and_then(Value::as_str);
-                    let max_val = topk_vals
-                        .iter()
-                        .find(|v| v.get("label").and_then(Value::as_str) == Some("max"))
-                        .and_then(|v| v.get("value"))
-                        .and_then(Value::as_str);
-                    if let (Some(min), Some(max)) = (min_val, max_val) {
-                        notes.push(format!("{} spans {} to {}", col.name, min, max));
-                    }
-                }
-            }
-        }
-    }
-
-    notes
+    vec![String::new()] /* ~ changed by cargo-mutants ~ */
 }
 
 fn count_nulls(data: &ColumnData) -> u64 {
     match data {
         ColumnData::Int(v) => v.iter().filter(|o| o.is_none()).count() as u64,
         ColumnData::Float(v) => v.iter().filter(|o| o.is_none()).count() as u64,
         ColumnData::Bool(v) => v.iter().filter(|o| o.is_none()).count() as u64,
         ColumnData::Decimal(v)

---- tests::count_nulls_per_variant stdout ----

thread 'tests::count_nulls_per_variant' panicked at src/lib.rs:899:13:
null note for Int with 2 nulls

---- tests::notes_date_span_format stdout ----

thread 'tests::notes_date_span_format' panicked at src/lib.rs:1055:9:
date span note present: [""]

---- tests::ac5_notes_nulls_and_dominant_group stdout ----

thread 'tests::ac5_notes_nulls_and_dominant_group' panicked at src/lib.rs:683:9:
expected a null note, got: [""]

failures:
    tests::ac5_notes_nulls_and_dominant_group
    tests::count_nulls_per_variant
    tests::notes_date_span_format
    tests::notes_dominance_threshold_boundary

test result: FAILED. 13 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
