*** src/lib.rs:421:22: replace == with != in generate_notes

*** mutation diff:
--- src/lib.rs
+++ replace == with != in generate_notes
@@ -413,17 +413,17 @@
         if null_count > 0 {
             notes.push(format!(
                 "{} of {} {} values are null",
                 null_count, total_rows, col.name
             ));
         }
 
         // Dominant group note for categoricals
-        if col.dtype == DType::Str {
+        if col.dtype != /* ~ changed by cargo-mutants ~ */ DType::Str {
             if let Some(cs) = stats.get(&col.unique_name) {
                 if let Some(topk_vals) = &cs.top_k {
                     if let Some(first) = topk_vals.first() {
                         if let Some(count) = first.get("count").and_then(Value::as_u64) {
                             let pct = count as f64 / total_rows as f64 * 100.0;
                             if pct >= 50.0 {
                                 let value = first
                                     .get("value")

---- tests::ac5_notes_nulls_and_dominant_group stdout ----

thread 'tests::ac5_notes_nulls_and_dominant_group' panicked at src/lib.rs:777:9:
expected a dominant-group note, got: []

---- tests::notes_dominance_threshold_boundary stdout ----

thread 'tests::notes_dominance_threshold_boundary' panicked at src/lib.rs:1034:9:
dominant-group note present at exactly 50%: []

failures:
    tests::ac5_notes_nulls_and_dominant_group
    tests::notes_dominance_threshold_boundary

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
