*** src/lib.rs:427:36: replace >= with < in generate_notes

*** mutation diff:
--- src/lib.rs
+++ replace >= with < in generate_notes
@@ -419,17 +419,17 @@
 
         // Dominant group note for categoricals
         if col.dtype == DType::Str {
             if let Some(cs) = stats.get(&col.unique_name) {
                 if let Some(topk_vals) = &cs.top_k {
                     if let Some(first) = topk_vals.first() {
                         if let Some(count) = first.get("count").and_then(Value::as_u64) {
                             let pct = count as f64 / total_rows as f64 * 100.0;
-                            if pct >= 50.0 {
+                            if pct < /* ~ changed by cargo-mutants ~ */ 50.0 {
                                 let value = first
                                     .get("value")
                                     .and_then(Value::as_str)
                                     .unwrap_or("(unknown)");
                                 notes.push(format!(
                                     "one {} group ({value:?}) accounts for {pct:.0}% of total",
                                     col.name
                                 ));

---- tests::notes_dominance_threshold_boundary stdout ----

thread 'tests::notes_dominance_threshold_boundary' panicked at src/lib.rs:1016:9:
no dominant-group note when top group is 33%: ["one region group (\"A\") accounts for 33% of total"]

---- tests::ac5_notes_nulls_and_dominant_group stdout ----

thread 'tests::ac5_notes_nulls_and_dominant_group' panicked at src/lib.rs:777:9:
expected a dominant-group note, got: []

failures:
    tests::ac5_notes_nulls_and_dominant_group
    tests::notes_dominance_threshold_boundary

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
