*** src/lib.rs:444:37: replace || with && in generate_notes

*** mutation diff:
--- src/lib.rs
+++ replace || with && in generate_notes
@@ -436,17 +436,17 @@
                             }
                         }
                     }
                 }
             }
         }
 
         // Date span note
-        if col.dtype == DType::Date || col.dtype == DType::Time {
+        if col.dtype == DType::Date && /* ~ changed by cargo-mutants ~ */ col.dtype == DType::Time {
             if let Some(cs) = stats.get(&col.unique_name) {
                 if let Some(topk_vals) = &cs.top_k {
                     let min_val = topk_vals
                         .iter()
                         .find(|v| v.get("label").and_then(Value::as_str) == Some("min"))
                         .and_then(|v| v.get("value"))
                         .and_then(Value::as_str);
                     let max_val = topk_vals

---- tests::notes_date_span_format stdout ----

thread 'tests::notes_date_span_format' panicked at src/lib.rs:1117:9:
date span note present: []

failures:
    tests::notes_date_span_format

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
