*** src/lib.rs:454:74: replace == with != in generate_notes

*** mutation diff:
--- src/lib.rs
+++ replace == with != in generate_notes
@@ -446,17 +446,17 @@
                 if let Some(topk_vals) = &cs.top_k {
                     let min_val = topk_vals
                         .iter()
                         .find(|v| v.get("label").and_then(Value::as_str) == Some("min"))
                         .and_then(|v| v.get("value"))
                         .and_then(Value::as_str);
                     let max_val = topk_vals
                         .iter()
-                        .find(|v| v.get("label").and_then(Value::as_str) == Some("max"))
+                        .find(|v| v.get("label").and_then(Value::as_str) != /* ~ changed by cargo-mutants ~ */ Some("max"))
                         .and_then(|v| v.get("value"))
                         .and_then(Value::as_str);
                     if let (Some(min), Some(max)) = (min_val, max_val) {
                         notes.push(format!("{} spans {} to {}", col.name, min, max));
                     }
                 }
             }
         }

---- tests::notes_date_span_format stdout ----

thread 'tests::notes_date_span_format' panicked at src/lib.rs:1120:9:
max date in note: event_date spans 2021-07-04 to 2021-07-04

failures:
    tests::notes_date_span_format

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
