*** src/lib.rs:469:5: replace count_nulls -> u64 with 1

*** mutation diff:
--- src/lib.rs
+++ replace count_nulls -> u64 with 1
@@ -461,26 +461,17 @@
             }
         }
     }
 
     notes
 }
 
 fn count_nulls(data: &ColumnData) -> u64 {
-    match data {
-        ColumnData::Int(v) => v.iter().filter(|o| o.is_none()).count() as u64,
-        ColumnData::Float(v) => v.iter().filter(|o| o.is_none()).count() as u64,
-        ColumnData::Bool(v) => v.iter().filter(|o| o.is_none()).count() as u64,
-        ColumnData::Decimal(v)
-        | ColumnData::Str(v)
-        | ColumnData::Date(v)
-        | ColumnData::Time(v) => v.iter().filter(|o| o.is_none()).count() as u64,
-        _ => 0,
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Enforce `cfg.max_bytes` by progressively truncating the sample.
 ///
 /// Stats are never removed.  If the zero-sample summary still exceeds
 /// `max_bytes`, this function panics (the caller's `max_bytes` is too small).
 fn enforce_max_bytes(
     mut summary: DatasetSummary,

---- tests::count_nulls_per_variant stdout ----

thread 'tests::count_nulls_per_variant' panicked at src/lib.rs:953:13:
correct null count: Some("1 of 4 n values are null")

failures:
    tests::count_nulls_per_variant

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
