*** src/lib.rs:470:9: delete match arm ColumnData::Int(v) in count_nulls

*** mutation diff:
--- src/lib.rs
+++ delete match arm ColumnData::Int(v) in count_nulls
@@ -462,17 +462,17 @@
         }
     }
 
     notes
 }
 
 fn count_nulls(data: &ColumnData) -> u64 {
     match data {
-        ColumnData::Int(v) => v.iter().filter(|o| o.is_none()).count() as u64,
+         /* ~ changed by cargo-mutants ~ */
         ColumnData::Float(v) => v.iter().filter(|o| o.is_none()).count() as u64,
         ColumnData::Bool(v) => v.iter().filter(|o| o.is_none()).count() as u64,
         ColumnData::Decimal(v)
         | ColumnData::Str(v)
         | ColumnData::Date(v)
         | ColumnData::Time(v) => v.iter().filter(|o| o.is_none()).count() as u64,
         _ => 0,
     }

---- tests::count_nulls_per_variant stdout ----

thread 'tests::count_nulls_per_variant' panicked at src/lib.rs:961:13:
null note for Int with 2 nulls

failures:
    tests::count_nulls_per_variant

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
