*** src/lib.rs:471:9: delete match arm ColumnData::Float(v) in count_nulls

*** mutation diff:
--- src/lib.rs
+++ delete match arm ColumnData::Float(v) in count_nulls
@@ -463,17 +463,17 @@
     }
 
     notes
 }
 
 fn count_nulls(data: &ColumnData) -> u64 {
     match data {
         ColumnData::Int(v) => v.iter().filter(|o| o.is_none()).count() as u64,
-        ColumnData::Float(v) => v.iter().filter(|o| o.is_none()).count() as u64,
+         /* ~ changed by cargo-mutants ~ */
         ColumnData::Bool(v) => v.iter().filter(|o| o.is_none()).count() as u64,
         ColumnData::Decimal(v)
         | ColumnData::Str(v)
         | ColumnData::Date(v)
         | ColumnData::Time(v) => v.iter().filter(|o| o.is_none()).count() as u64,
         _ => 0,
     }
 }

---- tests::count_nulls_per_variant stdout ----

thread 'tests::count_nulls_per_variant' panicked at src/lib.rs:971:13:
null note for Float with 1 null

---- tests::ac5_notes_nulls_and_dominant_group stdout ----

thread 'tests::ac5_notes_nulls_and_dominant_group' panicked at src/lib.rs:745:9:
expected a null note, got: []

failures:
    tests::ac5_notes_nulls_and_dominant_group
    tests::count_nulls_per_variant

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
