*** src/lib.rs:498:11: delete ! in enforce_max_bytes

*** mutation diff:
--- src/lib.rs
+++ delete ! in enforce_max_bytes
@@ -490,17 +490,17 @@
 ) -> DatasetSummary {
     // Fast path: already within budget.
     if serialized_len(&summary) <= cfg.max_bytes {
         return summary;
     }
 
     // Progressive truncation: remove tail rows one at a time.
     let original_sample_len = summary.sample.len();
-    while !summary.sample.is_empty() && serialized_len(&summary) > cfg.max_bytes {
+    while  /* ~ changed by cargo-mutants ~ */summary.sample.is_empty() && serialized_len(&summary) > cfg.max_bytes {
         summary.sample.pop();
     }
 
     // Add a truncation note if we removed anything.
     let new_sample_len = summary.sample.len();
     if new_sample_len < original_sample_len {
         let note = format!(
             "sample truncated from {} to {} rows to fit max_bytes={} (full result: {} rows)",

---- tests::ac6_max_bytes_truncates_sample_not_stats stdout ----

thread 'tests::ac6_max_bytes_truncates_sample_not_stats' panicked at src/lib.rs:513:5:
even the zero-sample summary exceeds max_bytes=1828 — increase max_bytes

failures:
    tests::ac6_max_bytes_truncates_sample_not_stats

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
