*** src/lib.rs:504:23: replace < with == in enforce_max_bytes

*** mutation diff:
--- src/lib.rs
+++ replace < with == in enforce_max_bytes
@@ -496,17 +496,17 @@
     // Progressive truncation: remove tail rows one at a time.
     let original_sample_len = summary.sample.len();
     while !summary.sample.is_empty() && serialized_len(&summary) > cfg.max_bytes {
         summary.sample.pop();
     }
 
     // Add a truncation note if we removed anything.
     let new_sample_len = summary.sample.len();
-    if new_sample_len < original_sample_len {
+    if new_sample_len == /* ~ changed by cargo-mutants ~ */ original_sample_len {
         let note = format!(
             "sample truncated from {} to {} rows to fit max_bytes={} (full result: {} rows)",
             original_sample_len, new_sample_len, cfg.max_bytes, row_count
         );
         notes.push(note.clone());
         summary.notes.push(note);
     }

---- tests::ac6_max_bytes_truncates_sample_not_stats stdout ----

thread 'tests::ac6_max_bytes_truncates_sample_not_stats' panicked at src/lib.rs:861:9:
expected a truncation note, got: []

failures:
    tests::ac6_max_bytes_truncates_sample_not_stats

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
