*** src/lib.rs:523:5: replace serialized_len -> usize with 1

*** mutation diff:
--- src/lib.rs
+++ replace serialized_len -> usize with 1
@@ -515,19 +515,17 @@
         "even the zero-sample summary exceeds max_bytes={} — increase max_bytes",
         cfg.max_bytes
     );
 
     summary
 }
 
 fn serialized_len(summary: &DatasetSummary) -> usize {
-    serde_json::to_vec(summary)
-        .expect("DatasetSummary is always serializable")
-        .len()
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 // ── Tests ───────────────────────────────────────────────────────────────────
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use dh_spec::{ColumnRole, DType};

---- tests::ac6_max_bytes_truncates_sample_not_stats stdout ----

thread 'tests::ac6_max_bytes_truncates_sample_not_stats' panicked at src/lib.rs:828:9:
size=1829 must be ≤ max_bytes=1828

failures:
    tests::ac6_max_bytes_truncates_sample_not_stats

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
