*** src/binder.rs:112:17: replace && with || in resolve_level

*** mutation diff:
--- src/binder.rs
+++ replace && with || in resolve_level
@@ -104,17 +104,17 @@
 ) -> Result<&'a ColumnEntry, Vec<&'a ColumnEntry>> {
     let hier_key = sel.hierarchy.to_lowercase();
     let level_key = sel.level.to_lowercase();
 
     let candidates: Vec<&ColumnEntry> = columns
         .iter()
         .filter(|c| {
             c.kind == "level"
-                && c.hierarchy
+                || /* ~ changed by cargo-mutants ~ */ c.hierarchy
                     .as_deref()
                     .is_some_and(|h| h.to_lowercase() == hier_key)
                 && c.level
                     .as_deref()
                     .is_some_and(|l| l.to_lowercase() == level_key)
         })
         .collect();

---- binder::binder_unit_tests::resolve_level_not_found_gives_empty_vec stdout ----

thread 'binder::binder_unit_tests::resolve_level_not_found_gives_empty_vec' panicked at src/binder.rs:493:9:
not-found level must be Err

---- integration_tests::unknown_dimension_not_found stdout ----

thread 'integration_tests::unknown_dimension_not_found' panicked at src/main.rs:369:9:
assertion failed: matches!(result, BindResult::NotFound(_))

---- integration_tests::dimension_binding_by_hierarchy_and_level stdout ----

thread 'integration_tests::dimension_binding_by_hierarchy_and_level' panicked at src/main.rs:355:22:
expected Bound, got Ambiguous([Object {"candidates": Array [String("time.calendar.[Year]"), String("time.calendar.[Month]")], "ref": String("dimension time.calendar:year")}])

failures:
    binder::binder_unit_tests::resolve_level_not_found_gives_empty_vec
    integration_tests::dimension_binding_by_hierarchy_and_level
    integration_tests::unknown_dimension_not_found

test result: FAILED. 26 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
