*** src/binder.rs:114:55: replace == with != in resolve_level

*** mutation diff:
--- src/binder.rs
+++ replace == with != in resolve_level
@@ -106,17 +106,17 @@
     let level_key = sel.level.to_lowercase();
 
     let candidates: Vec<&ColumnEntry> = columns
         .iter()
         .filter(|c| {
             c.kind == "level"
                 && c.hierarchy
                     .as_deref()
-                    .is_some_and(|h| h.to_lowercase() == hier_key)
+                    .is_some_and(|h| h.to_lowercase() != /* ~ changed by cargo-mutants ~ */ hier_key)
                 && c.level
                     .as_deref()
                     .is_some_and(|l| l.to_lowercase() == level_key)
         })
         .collect();
 
     match candidates.len() {
         1 => Ok(candidates[0]),

---- binder::binder_unit_tests::resolve_level_case_insensitive stdout ----

thread 'binder::binder_unit_tests::resolve_level_case_insensitive' panicked at src/binder.rs:343:9:
assertion failed: result.is_ok()

---- binder::binder_unit_tests::bind_ambiguous_dimension_is_ambiguous_not_not_found stdout ----

thread 'binder::binder_unit_tests::bind_ambiguous_dimension_is_ambiguous_not_not_found' panicked at src/binder.rs:528:9:
ambiguous dimension must yield BindResult::Ambiguous, got: NotFound(["NonExistentMeasureXYZ", "dimension time.calendar:Year"])

---- integration_tests::dimension_binding_by_hierarchy_and_level stdout ----

thread 'integration_tests::dimension_binding_by_hierarchy_and_level' panicked at src/main.rs:355:22:
expected Bound, got NotFound(["dimension time.calendar:year"])

failures:
    binder::binder_unit_tests::bind_ambiguous_dimension_is_ambiguous_not_not_found
    binder::binder_unit_tests::resolve_level_case_insensitive
    integration_tests::dimension_binding_by_hierarchy_and_level

test result: FAILED. 26 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
