*** src/binder.rs:165:32: replace match guard candidates.is_empty() with false in bind

*** mutation diff:
--- src/binder.rs
+++ replace match guard candidates.is_empty() with false in bind
@@ -157,17 +157,17 @@
                 bound_measures.push(BoundMeasureExt {
                     unique_name: entry.unique_name.clone(),
                     is_calc: entry.is_calc,
                     semi_additive,
                     trigger_hierarchies,
                     required_dimension: entry.required_dimension.clone(),
                 });
             }
-            Err(candidates) if candidates.is_empty() => {
+            Err(candidates) if false /* ~ changed by cargo-mutants ~ */ => {
                 not_found.push(m_ref.unique_name.clone());
             }
             Err(candidates) => {
                 ambiguous.push(serde_json::json!({
                     "ref": m_ref.unique_name,
                     "candidates": candidates.iter().map(|c| &c.unique_name).collect::<Vec<_>>(),
                 }));
             }

---- integration_tests::ac2_not_found_no_guess stdout ----

thread 'integration_tests::ac2_not_found_no_guess' panicked at src/main.rs:235:9:
must not guess a close match

---- integration_tests::ac2_fabricated_measure_not_found stdout ----

thread 'integration_tests::ac2_fabricated_measure_not_found' panicked at src/main.rs:224:22:
expected NotFound, got Ambiguous([Object {"candidates": Array [], "ref": String("NonExistentMeasureXYZ")}])

---- integration_tests::multiple_not_found_all_reported stdout ----

thread 'integration_tests::multiple_not_found_all_reported' panicked at src/main.rs:416:22:
expected NotFound, got Ambiguous([Object {"candidates": Array [], "ref": String("FakeA")}, Object {"candidates": Array [], "ref": String("FakeB")}])

failures:
    integration_tests::ac2_fabricated_measure_not_found
    integration_tests::ac2_not_found_no_guess
    integration_tests::multiple_not_found_all_reported
    integration_tests::not_found_takes_precedence_over_empty

test result: FAILED. 25 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
