*** src/binder.rs:219:49: replace == with != in bind

*** mutation diff:
--- src/binder.rs
+++ replace == with != in bind
@@ -211,17 +211,17 @@
             let calc_entries = snapshot
                 .describe_model
                 .as_ref()
                 .map_or(&[][..], |dm| dm.calc_groups.as_slice());
 
             let matches: Vec<_> = calc_entries
                 .iter()
                 .filter(|e| {
-                    e.group_name.to_lowercase() == group_key
+                    e.group_name.to_lowercase() != /* ~ changed by cargo-mutants ~ */ group_key
                         && e.member_name.to_lowercase() == member_key
                 })
                 .collect();
 
             match matches.len() {
                 1 => {
                     let e = matches[0];
                     bound_calc_group_members.push(BoundCalcGroupMember {

---- binder::binder_unit_tests::bind_calc_group_member_found stdout ----

thread 'binder::binder_unit_tests::bind_calc_group_member_found' panicked at src/binder.rs:569:22:
expected Bound, got NotFound(["calc_group_member TI::qtd"])

---- integration_tests::ac4_calc_group_member_resolved_with_mdx stdout ----

thread 'integration_tests::ac4_calc_group_member_resolved_with_mdx' panicked at src/main.rs:286:22:
expected Bound, got NotFound(["calc_group_member Time Intelligence::YTD"])

failures:
    binder::binder_unit_tests::bind_calc_group_member_found
    integration_tests::ac4_calc_group_member_resolved_with_mdx

test result: FAILED. 27 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
