*** src/binder.rs:220:57: replace == with != in bind

*** mutation diff:
--- src/binder.rs
+++ replace == with != in bind
@@ -212,17 +212,17 @@
                 .describe_model
                 .as_ref()
                 .map_or(&[][..], |dm| dm.calc_groups.as_slice());
 
             let matches: Vec<_> = calc_entries
                 .iter()
                 .filter(|e| {
                     e.group_name.to_lowercase() == group_key
-                        && e.member_name.to_lowercase() == member_key
+                        && e.member_name.to_lowercase() != /* ~ changed by cargo-mutants ~ */ member_key
                 })
                 .collect();
 
             match matches.len() {
                 1 => {
                     let e = matches[0];
                     bound_calc_group_members.push(BoundCalcGroupMember {
                         calc_group: calc_group.clone(),

---- binder::binder_unit_tests::bind_calc_group_member_found stdout ----

thread 'binder::binder_unit_tests::bind_calc_group_member_found' panicked at src/binder.rs:569:22:
expected Bound, got NotFound(["calc_group_member TI::qtd"])

---- integration_tests::ac4_calc_group_member_resolved_with_mdx stdout ----

thread 'integration_tests::ac4_calc_group_member_resolved_with_mdx' panicked at src/main.rs:286:22:
expected Bound, got NotFound(["calc_group_member Time Intelligence::YTD"])

---- integration_tests::ac4_missing_calc_group_member_not_found stdout ----

thread 'integration_tests::ac4_missing_calc_group_member_not_found' panicked at src/main.rs:300:9:
missing calc-group member must be not_found

failures:
    binder::binder_unit_tests::bind_calc_group_member_found
    integration_tests::ac4_calc_group_member_resolved_with_mdx
    integration_tests::ac4_missing_calc_group_member_not_found

test result: FAILED. 26 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
