*** src/binder.rs:225:17: delete match arm 1 in bind

*** mutation diff:
--- src/binder.rs
+++ delete match arm 1 in bind
@@ -217,25 +217,17 @@
                 .iter()
                 .filter(|e| {
                     e.group_name.to_lowercase() == group_key
                         && e.member_name.to_lowercase() == member_key
                 })
                 .collect();
 
             match matches.len() {
-                1 => {
-                    let e = matches[0];
-                    bound_calc_group_members.push(BoundCalcGroupMember {
-                        calc_group: calc_group.clone(),
-                        member: member.clone(),
-                        unique_name: e.unique_name.clone(),
-                        mdx: e.mdx.clone(),
-                    });
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 0 => {
                     not_found.push(format!("calc_group_member {calc_group}::{member}"));
                 }
                 _ => {
                     ambiguous.push(serde_json::json!({
                         "ref": format!("calc_group_member {calc_group}::{member}"),
                         "candidates": matches.iter().map(|e| &e.unique_name).collect::<Vec<_>>(),
                     }));

---- binder::binder_unit_tests::bind_calc_group_member_found stdout ----

thread 'binder::binder_unit_tests::bind_calc_group_member_found' panicked at src/binder.rs:561:22:
expected Bound, got Ambiguous([Object {"candidates": Array [String("calc.ti.QTD")], "ref": String("calc_group_member TI::qtd")}])

---- integration_tests::ac4_calc_group_member_resolved_with_mdx stdout ----

thread 'integration_tests::ac4_calc_group_member_resolved_with_mdx' panicked at src/main.rs:286:22:
expected Bound, got Ambiguous([Object {"candidates": Array [String("calc.time_intel.YTD")], "ref": String("calc_group_member Time Intelligence::YTD")}])

failures:
    binder::binder_unit_tests::bind_calc_group_member_found
    integration_tests::ac4_calc_group_member_resolved_with_mdx

test result: FAILED. 27 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
