*** src/binder.rs:251:8: delete ! in bind

*** mutation diff:
--- src/binder.rs
+++ delete ! in bind
@@ -243,17 +243,17 @@
             }
         }
     }
 
     // ── Collate results ───────────────────────────────────────────────────
     if !ambiguous.is_empty() {
         return BindResult::Ambiguous(ambiguous);
     }
-    if !not_found.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */not_found.is_empty() {
         return BindResult::NotFound(not_found);
     }
 
     BindResult::Bound(Box::new(BoundMqoOutput {
         mqo: mqo.clone(),
         measures: bound_measures,
         dimensions: bound_dimensions,
         calc_group_members: bound_calc_group_members,

---- binder::binder_unit_tests::bind_semi_additive_flags stdout ----

thread 'binder::binder_unit_tests::bind_semi_additive_flags' panicked at src/binder.rs:387:22:
expected Bound, got NotFound([])

---- binder::binder_unit_tests::bind_calc_group_member_found stdout ----

thread 'binder::binder_unit_tests::bind_calc_group_member_found' panicked at src/binder.rs:569:22:
expected Bound, got NotFound([])

---- integration_tests::ac1_valid_mqo_binds_and_exits_0 stdout ----

thread 'integration_tests::ac1_valid_mqo_binds_and_exits_0' panicked at src/main.rs:196:22:
expected Bound, got NotFound([])

failures:
    binder::binder_unit_tests::bind_calc_group_member_found
    binder::binder_unit_tests::bind_calc_group_member_missing_describe_model
    binder::binder_unit_tests::bind_semi_additive_flags
    integration_tests::ac1_case_insensitive_resolution
    integration_tests::ac1_valid_mqo_binds_and_exits_0
    integration_tests::ac2_fabricated_measure_not_found
    integration_tests::ac2_not_found_no_guess
    integration_tests::ac4_calc_group_member_resolved_with_mdx
    integration_tests::ac4_missing_calc_group_member_not_found
    integration_tests::ac5_non_semi_additive_has_empty_triggers
    integration_tests::ac5_semi_additive_flagged_with_trigger_hierarchies
    integration_tests::calc_measure_is_calc_flag

test result: FAILED. 11 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
