*** src/binder.rs:79:24: replace == with != in resolve_measure

*** mutation diff:
--- src/binder.rs
+++ replace == with != in resolve_measure
@@ -71,17 +71,17 @@
     let key = label.to_lowercase();
 
     // First: try exact unique_name match (case-insensitive)
     let by_unique: Vec<&ColumnEntry> = columns
         .iter()
         .filter(|c| c.kind == "measure" && c.unique_name.to_lowercase() == key)
         .collect();
 
-    if by_unique.len() == 1 {
+    if by_unique.len() != /* ~ changed by cargo-mutants ~ */ 1 {
         return Ok(by_unique[0]);
     }
     if by_unique.len() > 1 {
         return Err(by_unique);
     }
 
     // Second: try label match (case-insensitive)
     let by_label: Vec<&ColumnEntry> = columns

---- binder::binder_unit_tests::bind_ambiguous_dimension_is_ambiguous_not_not_found stdout ----

thread 'binder::binder_unit_tests::bind_ambiguous_dimension_is_ambiguous_not_not_found' panicked at src/binder.rs:80:28:
index out of bounds: the len is 0 but the index is 0

---- binder::binder_unit_tests::bind_semi_additive_flags stdout ----

thread 'binder::binder_unit_tests::bind_semi_additive_flags' panicked at src/binder.rs:80:28:
index out of bounds: the len is 0 but the index is 0

---- binder::binder_unit_tests::resolve_measure_ambiguous_returns_candidates stdout ----

thread 'binder::binder_unit_tests::resolve_measure_ambiguous_returns_candidates' panicked at src/binder.rs:80:28:
index out of bounds: the len is 0 but the index is 0

failures:
    binder::binder_unit_tests::bind_ambiguous_dimension_is_ambiguous_not_not_found
    binder::binder_unit_tests::bind_calc_group_member_found
    binder::binder_unit_tests::bind_calc_group_member_missing_describe_model
    binder::binder_unit_tests::bind_semi_additive_flags
    binder::binder_unit_tests::resolve_measure_ambiguous_returns_candidates
    binder::binder_unit_tests::resolve_measure_by_label_case_insensitive
    binder::binder_unit_tests::resolve_measure_duplicate_unique_name_is_ambiguous
    binder::binder_unit_tests::resolve_measure_exact_unique_name
    binder::binder_unit_tests::resolve_measure_not_found_gives_empty_vec
    binder::binder_unit_tests::resolve_measure_not_found_returns_empty_err
    binder::binder_unit_tests::resolve_measure_single_unique_name_match_preempts_label_search
    integration_tests::ac1_case_insensitive_resolution

test result: FAILED. 2 passed; 27 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
