*** src/binder.rs:82:24: replace > with == in resolve_measure

*** mutation diff:
--- src/binder.rs
+++ replace > with == in resolve_measure
@@ -74,17 +74,17 @@
     let by_unique: Vec<&ColumnEntry> = columns
         .iter()
         .filter(|c| c.kind == "measure" && c.unique_name.to_lowercase() == key)
         .collect();
 
     if by_unique.len() == 1 {
         return Ok(by_unique[0]);
     }
-    if by_unique.len() > 1 {
+    if by_unique.len() == /* ~ changed by cargo-mutants ~ */ 1 {
         return Err(by_unique);
     }
 
     // Second: try label match (case-insensitive)
     let by_label: Vec<&ColumnEntry> = columns
         .iter()
         .filter(|c| c.kind == "measure" && c.label.to_lowercase() == key)
         .collect();

---- binder::binder_unit_tests::resolve_measure_duplicate_unique_name_is_ambiguous stdout ----

thread 'binder::binder_unit_tests::resolve_measure_duplicate_unique_name_is_ambiguous' panicked at src/binder.rs:435:9:
assertion `left == right` failed: must report both candidates
  left: 0
 right: 2

failures:
    binder::binder_unit_tests::resolve_measure_duplicate_unique_name_is_ambiguous

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
