*** src/binder.rs:93:9: delete match arm 1 in resolve_measure

*** mutation diff:
--- src/binder.rs
+++ delete match arm 1 in resolve_measure
@@ -85,17 +85,17 @@
 
     // Second: try label match (case-insensitive)
     let by_label: Vec<&ColumnEntry> = columns
         .iter()
         .filter(|c| c.kind == "measure" && c.label.to_lowercase() == key)
         .collect();
 
     match by_label.len() {
-        1 => Ok(by_label[0]),
+         /* ~ changed by cargo-mutants ~ */
         0 => Err(vec![]),
         _ => Err(by_label),
     }
 }
 
 /// Resolve a dimension level selection against the column list.
 /// Matches by hierarchy (exact, case-insensitive) + level name (case-insensitive).
 fn resolve_level<'a>(

---- binder::binder_unit_tests::bind_calc_group_member_found stdout ----

thread 'binder::binder_unit_tests::bind_calc_group_member_found' panicked at src/binder.rs:569:22:
expected Bound, got Ambiguous([Object {"candidates": Array [String("sales.revenue")], "ref": String("Revenue")}])

---- binder::binder_unit_tests::bind_semi_additive_flags stdout ----

thread 'binder::binder_unit_tests::bind_semi_additive_flags' panicked at src/binder.rs:387:22:
expected Bound, got Ambiguous([Object {"candidates": Array [String("sales.balance")], "ref": String("Balance")}])

---- binder::binder_unit_tests::bind_calc_group_member_missing_describe_model stdout ----

thread 'binder::binder_unit_tests::bind_calc_group_member_missing_describe_model' panicked at src/binder.rs:414:9:
assertion failed: matches!(result, BindResult::NotFound(_))

failures:
    binder::binder_unit_tests::bind_calc_group_member_found
    binder::binder_unit_tests::bind_calc_group_member_missing_describe_model
    binder::binder_unit_tests::bind_semi_additive_flags
    binder::binder_unit_tests::resolve_measure_by_label_case_insensitive
    integration_tests::ac1_case_insensitive_resolution
    integration_tests::ac1_valid_mqo_binds_and_exits_0
    integration_tests::ac4_calc_group_member_resolved_with_mdx
    integration_tests::ac4_missing_calc_group_member_not_found
    integration_tests::ac5_non_semi_additive_has_empty_triggers
    integration_tests::ac5_semi_additive_flagged_with_trigger_hierarchies
    integration_tests::calc_measure_is_calc_flag
    integration_tests::dimension_binding_by_hierarchy_and_level

test result: FAILED. 15 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
