*** src/main.rs:38:5: replace main with ()

*** mutation diff:
--- src/main.rs
+++ replace main with ()
@@ -30,55 +30,17 @@
     mqo: PathBuf,
 
     /// Path to the catalog snapshot JSON file
     #[arg(long)]
     catalog: PathBuf,
 }
 
 fn main() {
-    let args = Args::parse();
-
-    // Load MQO
-    let mqo_text = std::fs::read_to_string(&args.mqo).unwrap_or_else(|e| {
-        eprintln!("mqo-bind: cannot read --mqo file: {e}");
-        process::exit(2);
-    });
-    let mqo: mqo_spec::Mqo = serde_json::from_str(&mqo_text).unwrap_or_else(|e| {
-        eprintln!("mqo-bind: --mqo file is not valid MQO JSON: {e}");
-        process::exit(2);
-    });
-
-    // Load catalog snapshot
-    let catalog_text = std::fs::read_to_string(&args.catalog).unwrap_or_else(|e| {
-        eprintln!("mqo-bind: cannot read --catalog file: {e}");
-        process::exit(2);
-    });
-    let snapshot: catalog::CatalogSnapshot =
-        serde_json::from_str(&catalog_text).unwrap_or_else(|e| {
-            eprintln!("mqo-bind: --catalog file is not valid snapshot JSON: {e}");
-            process::exit(2);
-        });
-
-    match binder::bind(&mqo, &snapshot) {
-        binder::BindResult::Bound(bound) => {
-            println!("{}", serde_json::to_string_pretty(&*bound).expect("serialize"));
-            process::exit(0);
-        }
-        binder::BindResult::Ambiguous(items) => {
-            let out = serde_json::json!({ "ambiguous": items });
-            println!("{}", serde_json::to_string_pretty(&out).expect("serialize"));
-            process::exit(3);
-        }
-        binder::BindResult::NotFound(items) => {
-            let out = serde_json::json!({ "not_found": items });
-            println!("{}", serde_json::to_string_pretty(&out).expect("serialize"));
-            process::exit(4);
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod integration_tests {
     use crate::binder::{bind, BindResult};
     use crate::catalog::{
         CalcGroupEntry, CatalogSnapshot, ColumnEntry, DescribeModelOutput, SemiAdditiveInfo,
     };

---- cli_ambiguous_exits_3 stdout ----

thread 'cli_ambiguous_exits_3' panicked at tests/integration_cli.rs:129:5:
assertion `left == right` failed: expected exit 3; stdout: 
  left: Some(0)
 right: Some(3)

---- cli_not_found_exits_4 stdout ----

thread 'cli_not_found_exits_4' panicked at tests/integration_cli.rs:102:5:
assertion `left == right` failed: expected exit 4; stdout: 
  left: Some(0)
 right: Some(4)

---- cli_bad_mqo_path_exits_2 stdout ----

thread 'cli_bad_mqo_path_exits_2' panicked at tests/integration_cli.rs:149:5:
assertion `left == right` failed: expected exit 2 for bad --mqo path
  left: Some(0)
 right: Some(2)

failures:
    cli_ambiguous_exits_3
    cli_bad_catalog_path_exits_2
    cli_bad_mqo_path_exits_2
    cli_bound_exits_0
    cli_not_found_exits_4

test result: FAILED. 0 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.99s

*** result: Failure(101)
