*** src/binder.rs:117:55: replace == with != in resolve_level

*** mutation diff:
--- src/binder.rs
+++ replace == with != in resolve_level
@@ -109,17 +109,17 @@
         .iter()
         .filter(|c| {
             c.kind == "level"
                 && c.hierarchy
                     .as_deref()
                     .is_some_and(|h| h.to_lowercase() == hier_key)
                 && c.level
                     .as_deref()
-                    .is_some_and(|l| l.to_lowercase() == level_key)
+                    .is_some_and(|l| l.to_lowercase() != /* ~ changed by cargo-mutants ~ */ level_key)
         })
         .collect();
 
     match candidates.len() {
         1 => Ok(candidates[0]),
         0 => Err(vec![]),
         _ => Err(candidates),
     }

---- binder::binder_unit_tests::resolve_level_case_insensitive stdout ----

thread 'binder::binder_unit_tests::resolve_level_case_insensitive' panicked at src/binder.rs:343:9:
assertion failed: result.is_ok()

---- binder::binder_unit_tests::resolve_level_not_found_gives_empty_vec stdout ----

thread 'binder::binder_unit_tests::resolve_level_not_found_gives_empty_vec' panicked at src/binder.rs:493:9:
not-found level must be Err

---- binder::binder_unit_tests::bind_ambiguous_dimension_is_ambiguous_not_not_found stdout ----

thread 'binder::binder_unit_tests::bind_ambiguous_dimension_is_ambiguous_not_not_found' panicked at src/binder.rs:528:9:
ambiguous dimension must yield BindResult::Ambiguous, got: NotFound(["NonExistentMeasureXYZ", "dimension time.calendar:Year"])

failures:
    binder::binder_unit_tests::bind_ambiguous_dimension_is_ambiguous_not_not_found
    binder::binder_unit_tests::resolve_level_case_insensitive
    binder::binder_unit_tests::resolve_level_not_found_gives_empty_vec
    integration_tests::dimension_binding_by_hierarchy_and_level
    integration_tests::unknown_dimension_not_found

test result: FAILED. 24 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
