*** src/binder.rs:122:9: delete match arm 1 in resolve_level

*** mutation diff:
--- src/binder.rs
+++ delete match arm 1 in resolve_level
@@ -114,17 +114,17 @@
                     .is_some_and(|h| h.to_lowercase() == hier_key)
                 && c.level
                     .as_deref()
                     .is_some_and(|l| l.to_lowercase() == level_key)
         })
         .collect();
 
     match candidates.len() {
-        1 => Ok(candidates[0]),
+         /* ~ changed by cargo-mutants ~ */
         0 => Err(vec![]),
         _ => Err(candidates),
     }
 }
 
 // ── Main bind function ────────────────────────────────────────────────────────
 
 /// Bind an MQO against a catalog snapshot.

---- binder::binder_unit_tests::resolve_level_case_insensitive stdout ----

thread 'binder::binder_unit_tests::resolve_level_case_insensitive' panicked at src/binder.rs:343:9:
assertion failed: result.is_ok()

---- integration_tests::dimension_binding_by_hierarchy_and_level stdout ----

thread 'integration_tests::dimension_binding_by_hierarchy_and_level' panicked at src/main.rs:355:22:
expected Bound, got Ambiguous([Object {"candidates": Array [String("time.calendar.[Year]")], "ref": String("dimension time.calendar:year")}])

failures:
    binder::binder_unit_tests::resolve_level_case_insensitive
    integration_tests::dimension_binding_by_hierarchy_and_level

test result: FAILED. 27 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
