*** src/binder.rs:165:32: replace match guard candidates.is_empty() with true in bind

*** mutation diff:
--- src/binder.rs
+++ replace match guard candidates.is_empty() with true in bind
@@ -157,17 +157,17 @@
                 bound_measures.push(BoundMeasureExt {
                     unique_name: entry.unique_name.clone(),
                     is_calc: entry.is_calc,
                     semi_additive,
                     trigger_hierarchies,
                     required_dimension: entry.required_dimension.clone(),
                 });
             }
-            Err(candidates) if candidates.is_empty() => {
+            Err(candidates) if true /* ~ changed by cargo-mutants ~ */ => {
                 not_found.push(m_ref.unique_name.clone());
             }
             Err(candidates) => {
                 ambiguous.push(serde_json::json!({
                     "ref": m_ref.unique_name,
                     "candidates": candidates.iter().map(|c| &c.unique_name).collect::<Vec<_>>(),
                 }));
             }

---- integration_tests::ac3_ambiguous_label_returns_candidates stdout ----

thread 'integration_tests::ac3_ambiguous_label_returns_candidates' panicked at src/main.rs:265:22:
expected Ambiguous, got NotFound(["Revenue"])

failures:
    integration_tests::ac3_ambiguous_label_returns_candidates

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
