*** src/binder.rs:220:25: replace && with || in bind

*** mutation diff:
--- src/binder.rs
+++ replace && with || in bind
@@ -212,17 +212,17 @@
                 .describe_model
                 .as_ref()
                 .map_or(&[][..], |dm| dm.calc_groups.as_slice());
 
             let matches: Vec<_> = calc_entries
                 .iter()
                 .filter(|e| {
                     e.group_name.to_lowercase() == group_key
-                        && e.member_name.to_lowercase() == member_key
+                        || /* ~ changed by cargo-mutants ~ */ e.member_name.to_lowercase() == member_key
                 })
                 .collect();
 
             match matches.len() {
                 1 => {
                     let e = matches[0];
                     bound_calc_group_members.push(BoundCalcGroupMember {
                         calc_group: calc_group.clone(),

---- integration_tests::ac4_missing_calc_group_member_not_found stdout ----

thread 'integration_tests::ac4_missing_calc_group_member_not_found' panicked at src/main.rs:300:9:
missing calc-group member must be not_found

failures:
    integration_tests::ac4_missing_calc_group_member_not_found

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
