*** src/binder.rs:234:17: delete match arm 0 in bind

*** mutation diff:
--- src/binder.rs
+++ delete match arm 0 in bind
@@ -226,19 +226,17 @@
                     let e = matches[0];
                     bound_calc_group_members.push(BoundCalcGroupMember {
                         calc_group: calc_group.clone(),
                         member: member.clone(),
                         unique_name: e.unique_name.clone(),
                         mdx: e.mdx.clone(),
                     });
                 }
-                0 => {
-                    not_found.push(format!("calc_group_member {calc_group}::{member}"));
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => {
                     ambiguous.push(serde_json::json!({
                         "ref": format!("calc_group_member {calc_group}::{member}"),
                         "candidates": matches.iter().map(|e| &e.unique_name).collect::<Vec<_>>(),
                     }));
                 }
             }
         }

---- binder::binder_unit_tests::bind_calc_group_member_missing_describe_model stdout ----

thread 'binder::binder_unit_tests::bind_calc_group_member_missing_describe_model' panicked at src/binder.rs:412:9:
assertion failed: matches!(result, BindResult::NotFound(_))

---- integration_tests::ac4_missing_calc_group_member_not_found stdout ----

thread 'integration_tests::ac4_missing_calc_group_member_not_found' panicked at src/main.rs:300:9:
missing calc-group member must be not_found

failures:
    binder::binder_unit_tests::bind_calc_group_member_missing_describe_model
    integration_tests::ac4_missing_calc_group_member_not_found

test result: FAILED. 27 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
