*** src/binder.rs:248:8: delete ! in bind

*** mutation diff:
--- src/binder.rs
+++ delete ! in bind
@@ -240,17 +240,17 @@
                         "candidates": matches.iter().map(|e| &e.unique_name).collect::<Vec<_>>(),
                     }));
                 }
             }
         }
     }
 
     // ── Collate results ───────────────────────────────────────────────────
-    if !ambiguous.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */ambiguous.is_empty() {
         return BindResult::Ambiguous(ambiguous);
     }
     if !not_found.is_empty() {
         return BindResult::NotFound(not_found);
     }
 
     BindResult::Bound(Box::new(BoundMqoOutput {
         mqo: mqo.clone(),

---- binder::binder_unit_tests::bind_ambiguous_dimension_is_ambiguous_not_not_found stdout ----

thread 'binder::binder_unit_tests::bind_ambiguous_dimension_is_ambiguous_not_not_found' panicked at src/binder.rs:528:9:
ambiguous dimension must yield BindResult::Ambiguous, got: NotFound(["NonExistentMeasureXYZ"])

---- binder::binder_unit_tests::bind_calc_group_member_found stdout ----

thread 'binder::binder_unit_tests::bind_calc_group_member_found' panicked at src/binder.rs:569:22:
expected Bound, got Ambiguous([])

---- binder::binder_unit_tests::bind_calc_group_member_missing_describe_model stdout ----

thread 'binder::binder_unit_tests::bind_calc_group_member_missing_describe_model' panicked at src/binder.rs:414:9:
assertion failed: matches!(result, BindResult::NotFound(_))

failures:
    binder::binder_unit_tests::bind_ambiguous_dimension_is_ambiguous_not_not_found
    binder::binder_unit_tests::bind_calc_group_member_found
    binder::binder_unit_tests::bind_calc_group_member_missing_describe_model
    binder::binder_unit_tests::bind_semi_additive_flags
    integration_tests::ac1_case_insensitive_resolution
    integration_tests::ac1_valid_mqo_binds_and_exits_0
    integration_tests::ac2_fabricated_measure_not_found
    integration_tests::ac2_not_found_no_guess
    integration_tests::ac3_ambiguous_label_returns_candidates
    integration_tests::ac4_calc_group_member_resolved_with_mdx
    integration_tests::ac4_missing_calc_group_member_not_found
    integration_tests::ac5_non_semi_additive_has_empty_triggers

test result: FAILED. 9 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
