*** src/binder.rs:76:28: replace == with != in resolve_measure

*** mutation diff:
--- src/binder.rs
+++ replace == with != in resolve_measure
@@ -68,17 +68,17 @@
     label: &str,
     columns: &'a [ColumnEntry],
 ) -> Result<&'a ColumnEntry, Vec<&'a ColumnEntry>> {
     let key = label.to_lowercase();
 
     // First: try exact unique_name match (case-insensitive)
     let by_unique: Vec<&ColumnEntry> = columns
         .iter()
-        .filter(|c| c.kind == "measure" && c.unique_name.to_lowercase() == key)
+        .filter(|c| c.kind != /* ~ changed by cargo-mutants ~ */ "measure" && c.unique_name.to_lowercase() == key)
         .collect();
 
     if by_unique.len() == 1 {
         return Ok(by_unique[0]);
     }
     if by_unique.len() > 1 {
         return Err(by_unique);
     }

---- binder::binder_unit_tests::resolve_measure_exact_unique_name stdout ----

thread 'binder::binder_unit_tests::resolve_measure_exact_unique_name' panicked at src/binder.rs:299:9:
assertion failed: result.is_ok()

---- binder::binder_unit_tests::resolve_measure_duplicate_unique_name_is_ambiguous stdout ----

thread 'binder::binder_unit_tests::resolve_measure_duplicate_unique_name_is_ambiguous' panicked at src/binder.rs:435:9:
assertion `left == right` failed: must report both candidates
  left: 0
 right: 2

---- binder::binder_unit_tests::resolve_measure_single_unique_name_match_preempts_label_search stdout ----

thread 'binder::binder_unit_tests::resolve_measure_single_unique_name_match_preempts_label_search' panicked at src/binder.rs:454:9:
single unique_name match must return Ok, got: Err([])

failures:
    binder::binder_unit_tests::resolve_measure_duplicate_unique_name_is_ambiguous
    binder::binder_unit_tests::resolve_measure_exact_unique_name
    binder::binder_unit_tests::resolve_measure_single_unique_name_match_preempts_label_search
    integration_tests::unique_name_passthrough

test result: FAILED. 25 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
