*** src/binder.rs:76:41: replace && with || in resolve_measure

*** mutation diff:
--- src/binder.rs
+++ replace && with || in resolve_measure
@@ -68,17 +68,17 @@
     label: &str,
     columns: &'a [ColumnEntry],
 ) -> Result<&'a ColumnEntry, Vec<&'a ColumnEntry>> {
     let key = label.to_lowercase();
 
     // First: try exact unique_name match (case-insensitive)
     let by_unique: Vec<&ColumnEntry> = columns
         .iter()
-        .filter(|c| c.kind == "measure" && c.unique_name.to_lowercase() == key)
+        .filter(|c| c.kind == "measure" || /* ~ changed by cargo-mutants ~ */ c.unique_name.to_lowercase() == key)
         .collect();
 
     if by_unique.len() == 1 {
         return Ok(by_unique[0]);
     }
     if by_unique.len() > 1 {
         return Err(by_unique);
     }

---- binder::binder_unit_tests::resolve_measure_not_found_returns_empty_err stdout ----

thread 'binder::binder_unit_tests::resolve_measure_not_found_returns_empty_err' panicked at src/binder.rs:315:9:
assertion failed: result.is_err()

---- binder::binder_unit_tests::resolve_measure_not_found_gives_empty_vec stdout ----

thread 'binder::binder_unit_tests::resolve_measure_not_found_gives_empty_vec' panicked at src/binder.rs:470:9:
not-found must be Err

---- binder::binder_unit_tests::resolve_measure_single_unique_name_match_preempts_label_search stdout ----

thread 'binder::binder_unit_tests::resolve_measure_single_unique_name_match_preempts_label_search' panicked at src/binder.rs:454:9:

failures:
    binder::binder_unit_tests::resolve_measure_not_found_gives_empty_vec
    binder::binder_unit_tests::resolve_measure_not_found_returns_empty_err
    binder::binder_unit_tests::resolve_measure_single_unique_name_match_preempts_label_search
    integration_tests::ac1_case_insensitive_resolution
    integration_tests::ac1_valid_mqo_binds_and_exits_0
    integration_tests::ac2_fabricated_measure_not_found
    integration_tests::ac2_not_found_no_guess
    integration_tests::ac4_calc_group_member_resolved_with_mdx
    integration_tests::ac4_missing_calc_group_member_not_found
    integration_tests::ac5_non_semi_additive_has_empty_triggers
    integration_tests::ac5_semi_additive_flagged_with_trigger_hierarchies
    integration_tests::calc_measure_is_calc_flag

test result: FAILED. 11 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
