*** src/binder.rs:89:28: replace == with != in resolve_measure

*** mutation diff:
--- src/binder.rs
+++ replace == with != in resolve_measure
@@ -81,17 +81,17 @@
     }
     if by_unique.len() > 1 {
         return Err(by_unique);
     }
 
     // Second: try label match (case-insensitive)
     let by_label: Vec<&ColumnEntry> = columns
         .iter()
-        .filter(|c| c.kind == "measure" && c.label.to_lowercase() == key)
+        .filter(|c| c.kind != /* ~ changed by cargo-mutants ~ */ "measure" && c.label.to_lowercase() == key)
         .collect();
 
     match by_label.len() {
         1 => Ok(by_label[0]),
         0 => Err(vec![]),
         _ => Err(by_label),
     }
 }

---- binder::binder_unit_tests::resolve_measure_by_label_case_insensitive stdout ----

thread 'binder::binder_unit_tests::resolve_measure_by_label_case_insensitive' panicked at src/binder.rs:307:9:
assertion failed: result.is_ok()

---- binder::binder_unit_tests::bind_calc_group_member_found stdout ----

thread 'binder::binder_unit_tests::bind_calc_group_member_found' panicked at src/binder.rs:569:22:
expected Bound, got NotFound(["Revenue"])

---- binder::binder_unit_tests::bind_semi_additive_flags stdout ----

thread 'binder::binder_unit_tests::bind_semi_additive_flags' panicked at src/binder.rs:387:22:
expected Bound, got NotFound(["Balance"])

failures:
    binder::binder_unit_tests::bind_calc_group_member_found
    binder::binder_unit_tests::bind_semi_additive_flags
    binder::binder_unit_tests::resolve_measure_ambiguous_returns_candidates
    binder::binder_unit_tests::resolve_measure_by_label_case_insensitive
    integration_tests::ac1_case_insensitive_resolution
    integration_tests::ac1_valid_mqo_binds_and_exits_0
    integration_tests::ac3_ambiguous_label_returns_candidates
    integration_tests::ac4_calc_group_member_resolved_with_mdx
    integration_tests::ac5_non_semi_additive_has_empty_triggers
    integration_tests::ac5_semi_additive_flagged_with_trigger_hierarchies
    integration_tests::calc_measure_is_calc_flag
    integration_tests::dimension_binding_by_hierarchy_and_level

test result: FAILED. 16 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
