*** src/binder.rs:89:41: replace && with || in resolve_measure

*** mutation diff:
--- src/binder.rs
+++ replace && with || in resolve_measure
@@ -81,17 +81,17 @@
     }
     if by_unique.len() > 1 {
         return Err(by_unique);
     }
 
     // Second: try label match (case-insensitive)
     let by_label: Vec<&ColumnEntry> = columns
         .iter()
-        .filter(|c| c.kind == "measure" && c.label.to_lowercase() == key)
+        .filter(|c| c.kind == "measure" || /* ~ changed by cargo-mutants ~ */ c.label.to_lowercase() == key)
         .collect();
 
     match by_label.len() {
         1 => Ok(by_label[0]),
         0 => Err(vec![]),
         _ => Err(by_label),
     }
 }

---- integration_tests::ac2_not_found_no_guess stdout ----

thread 'integration_tests::ac2_not_found_no_guess' panicked at src/main.rs:235:9:
must not guess a close match

---- binder::binder_unit_tests::resolve_measure_not_found_returns_empty_err stdout ----

thread 'binder::binder_unit_tests::resolve_measure_not_found_returns_empty_err' panicked at src/binder.rs:315:9:
assertion failed: result.is_err()

---- binder::binder_unit_tests::resolve_measure_not_found_gives_empty_vec stdout ----

thread 'binder::binder_unit_tests::resolve_measure_not_found_gives_empty_vec' panicked at src/binder.rs:470:9:
not-found must be Err

failures:
    binder::binder_unit_tests::resolve_measure_not_found_gives_empty_vec
    binder::binder_unit_tests::resolve_measure_not_found_returns_empty_err
    integration_tests::ac1_case_insensitive_resolution
    integration_tests::ac1_valid_mqo_binds_and_exits_0
    integration_tests::ac2_fabricated_measure_not_found
    integration_tests::ac2_not_found_no_guess
    integration_tests::ac4_calc_group_member_resolved_with_mdx
    integration_tests::ac4_missing_calc_group_member_not_found
    integration_tests::ac5_non_semi_additive_has_empty_triggers
    integration_tests::ac5_semi_additive_flagged_with_trigger_hierarchies
    integration_tests::calc_measure_is_calc_flag
    integration_tests::dimension_binding_by_hierarchy_and_level

test result: FAILED. 13 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
