*** src/binder.rs:89:67: replace == with != in resolve_measure

*** mutation diff:
--- src/binder.rs
+++ replace == with != in resolve_measure
@@ -81,17 +81,17 @@
     }
     if by_unique.len() > 1 {
         return Err(by_unique);
     }
 
     // Second: try label match (case-insensitive)
     let by_label: Vec<&ColumnEntry> = columns
         .iter()
-        .filter(|c| c.kind == "measure" && c.label.to_lowercase() == key)
+        .filter(|c| c.kind == "measure" && c.label.to_lowercase() != /* ~ changed by cargo-mutants ~ */ key)
         .collect();
 
     match by_label.len() {
         1 => Ok(by_label[0]),
         0 => Err(vec![]),
         _ => Err(by_label),
     }
 }

---- binder::binder_unit_tests::resolve_measure_by_label_case_insensitive stdout ----

thread 'binder::binder_unit_tests::resolve_measure_by_label_case_insensitive' panicked at src/binder.rs:307:9:
assertion failed: result.is_ok()

---- binder::binder_unit_tests::resolve_measure_ambiguous_returns_candidates stdout ----

thread 'binder::binder_unit_tests::resolve_measure_ambiguous_returns_candidates' panicked at src/binder.rs:327:9:
assertion `left == right` failed
  left: 0
 right: 2

---- binder::binder_unit_tests::resolve_measure_not_found_gives_empty_vec stdout ----

thread 'binder::binder_unit_tests::resolve_measure_not_found_gives_empty_vec' panicked at src/binder.rs:470:9:
not-found must be Err

failures:
    binder::binder_unit_tests::bind_calc_group_member_found
    binder::binder_unit_tests::bind_semi_additive_flags
    binder::binder_unit_tests::resolve_measure_ambiguous_returns_candidates
    binder::binder_unit_tests::resolve_measure_by_label_case_insensitive
    binder::binder_unit_tests::resolve_measure_not_found_gives_empty_vec
    binder::binder_unit_tests::resolve_measure_not_found_returns_empty_err
    integration_tests::ac1_case_insensitive_resolution
    integration_tests::ac1_valid_mqo_binds_and_exits_0
    integration_tests::ac2_fabricated_measure_not_found
    integration_tests::ac2_not_found_no_guess
    integration_tests::ac4_calc_group_member_resolved_with_mdx
    integration_tests::ac4_missing_calc_group_member_not_found

test result: FAILED. 9 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
